In [1]:
import pandas as pd
import numpy as np

In [2]:
vendas= pd.read_csv('Aula 2.csv', sep=";", engine="python").transpose()

In [3]:
vendas.head()

,0,1,2,3,4,5,6,7,8,9,...,1276,1277,1278,1279,1280,1281,1282,1283,1284,1285
ï»¿Nome,Elizeu,Andrew,Andrew,Paloma,Iago,Paloma,Patricia,Maryanna,Joyce,Andrew,...,Andrew,Izabel,Jucelia,Paloma,Iago,Izabel,Joyce,Jucelia,Maryanna,Eduarda
Sobrenome,Barros,Carvalhal,Carvalhal,Farias,Bensdorp,Farias,Camara,Correa,Ribas,Carvalhal,...,Carvalhal,Milagre,Bailly,Farias,Bensdorp,Milagre,Ribas,Bailly,Correa,Figueiredo
Data de Nascimento,16/12/1993,18/07/1992,12/02/1985,29/03/1989,11/12/1989,22/12/1993,10/09/1991,06/05/1988,02/08/1985,15/12/1986,...,28/02/1986,09/01/1985,30/11/1988,29/01/1990,13/01/1986,21/01/1989,31/03/1985,30/06/1990,29/11/1992,06/05/1992
Loja,Salvador,BrasÃ­lia,SÃ£o Paulo,Rio de Janeiro,BrasÃ­lia,BrasÃ­lia,SÃ£o Paulo,Porto Alegre,Fortaleza,Rio de Janeiro,...,Curitiba,Curitiba,Rio de Janeiro,Salvador,SÃ£o Paulo,Curitiba,BrasÃ­lia,Rio de Janeiro,Rio de Janeiro,Salvador
Produto,Casaco,Camiseta,Sapato,Vestido,Vestido,Sapato,SandÃ¡lia,Saia,Saia,Vestido,...,Vestido,Camiseta,Vestido,Vestido,Bermuda,Casaco,Sapato,Sapato,Casaco,Sapato

In [4]:
vendas =vendas.transpose()

In [5]:
vendas

,ï»¿Nome,Sobrenome,Data de Nascimento,Loja,Produto,Data da Venda,Quantidade Vendida,PreÃ§o do Produto
0,Elizeu,Barros,16/12/1993,Salvador,Casaco,02/01/2018,105,"R$150,00"
1,Andrew,Carvalhal,18/07/1992,BrasÃ­lia,Camiseta,02/01/2018,57,"R$250,00"
2,Andrew,Carvalhal,12/02/1985,SÃ£o Paulo,Sapato,02/01/2018,44,"R$150,00"
3,Paloma,Farias,29/03/1989,Rio de Janeiro,Vestido,02/01/2018,55,"R$55,00"
4,Iago,Bensdorp,11/12/1989,BrasÃ­lia,Vestido,02/01/2018,7,"R$75,00"
...,...,...,...,...,...,...,...,...
1281,Izabel,Milagre,21/01/1989,Curitiba,Casaco,30/12/2018,88,"R$230,00"
1282,Joyce,Ribas,31/03/1985,BrasÃ­lia,Sapato,30/12/2018,121,"R$85,00"
1283,Jucelia,Bailly,30/06/1990,Rio de Janeiro,Sapato,30/12/2018,61,"R$25,00"
1284,Maryanna,Correa,29/11/1992,Rio de Janeiro,Casaco,30/12/2018,28,"R$30,00"
1285,Eduarda,Figueiredo,06/05/1992,Salvador,Sapato,31/12/2018,31,"R$30,00"

In [6]:
vendas.columns = ['Nome','Sobrenome', 'Data de Nascimento', 'Loja','Produto', 'Data da Venda', 'Quantidade Vendida', 'Preco']

In [7]:
vendas.columns

Index(['Nome', 'Sobrenome', 'Data de Nascimento', 'Loja', 'Produto',
       'Data da Venda', 'Quantidade Vendida', 'Preco'],
      dtype='object')

In [8]:
vendas.head()

,Nome,Sobrenome,Data de Nascimento,Loja,Produto,Data da Venda,Quantidade Vendida,Preco
0,Elizeu,Barros,16/12/1993,Salvador,Casaco,02/01/2018,105,"R$150,00"
1,Andrew,Carvalhal,18/07/1992,BrasÃ­lia,Camiseta,02/01/2018,57,"R$250,00"
2,Andrew,Carvalhal,12/02/1985,SÃ£o Paulo,Sapato,02/01/2018,44,"R$150,00"
3,Paloma,Farias,29/03/1989,Rio de Janeiro,Vestido,02/01/2018,55,"R$55,00"
4,Iago,Bensdorp,11/12/1989,BrasÃ­lia,Vestido,02/01/2018,7,"R$75,00"

In [9]:
vendas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1286 entries, 0 to 1285
Data columns (total 8 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Nome                1286 non-null   object
 1   Sobrenome           1286 non-null   object
 2   Data de Nascimento  1286 non-null   object
 3   Loja                1286 non-null   object
 4   Produto             1286 non-null   object
 5   Data da Venda       1286 non-null   object
 6   Quantidade Vendida  1286 non-null   object
 7   Preco               1286 non-null   object
dtypes: object(8)
memory usage: 80.5+ KB

In [10]:
vendas['Preco']= vendas['Preco'].str.strip('R$')

In [11]:
vendas['Preco'] = vendas['Preco'].str.replace('R','')

In [12]:
vendas['Preco'] = vendas['Preco'].str.replace('$','')

In [13]:
vendas['Preco'] = vendas['Preco'].str.replace(',00','')

In [14]:
vendas['Preco'] = vendas['Preco'].astype(int)

In [15]:
vendas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1286 entries, 0 to 1285
Data columns (total 8 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Nome                1286 non-null   object
 1   Sobrenome           1286 non-null   object
 2   Data de Nascimento  1286 non-null   object
 3   Loja                1286 non-null   object
 4   Produto             1286 non-null   object
 5   Data da Venda       1286 non-null   object
 6   Quantidade Vendida  1286 non-null   object
 7   Preco               1286 non-null   int32
dtypes: int32(1), object(7)
memory usage: 75.5+ KB

In [16]:
vendas['Quantidade Vendida']= vendas['Quantidade Vendida'].astype(int)

In [17]:
vendas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1286 entries, 0 to 1285
Data columns (total 8 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Nome                1286 non-null   object
 1   Sobrenome           1286 non-null   object
 2   Data de Nascimento  1286 non-null   object
 3   Loja                1286 non-null   object
 4   Produto             1286 non-null   object
 5   Data da Venda       1286 non-null   object
 6   Quantidade Vendida  1286 non-null   int32
 7   Preco               1286 non-null   int32
dtypes: int32(2), object(6)
memory usage: 70.5+ KB

In [18]:
import plotly.express as px

In [19]:
from datetime import date as dt

In [20]:
vendas = vendas.rename(columns = {'Data da Venda':'Data'})

In [21]:
vendas.columns

Index(['Nome', 'Sobrenome', 'Data de Nascimento', 'Loja', 'Produto', 'Data',
       'Quantidade Vendida', 'Preco'],
      dtype='object')

In [22]:
vendas['Data'] =pd.to_datetime(vendas['Data'])

In [23]:
max(vendas['Data'])

Timestamp('2018-12-31 00:00:00')

In [24]:
vendas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1286 entries, 0 to 1285
Data columns (total 8 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Nome                1286 non-null   object
 1   Sobrenome           1286 non-null   object
 2   Data de Nascimento  1286 non-null   object
 3   Loja                1286 non-null   object
 4   Produto             1286 non-null   object
 5   Data                1286 non-null   datetime64[ns]
 6   Quantidade Vendida  1286 non-null   int32
 7   Preco               1286 non-null   int32
dtypes: datetime64[ns](1), int32(2), object(5)
memory usage: 70.5+ KB

In [25]:
vendas['Faturamento']= vendas['Quantidade Vendida'] * vendas['Preco']

In [26]:
vendas.head()

,Nome,Sobrenome,Data de Nascimento,Loja,Produto,Data,Quantidade Vendida,Preco,Faturamento
0,Elizeu,Barros,16/12/1993,Salvador,Casaco,2018-02-01,105,150,15750
1,Andrew,Carvalhal,18/07/1992,BrasÃ­lia,Camiseta,2018-02-01,57,250,14250
2,Andrew,Carvalhal,12/02/1985,SÃ£o Paulo,Sapato,2018-02-01,44,150,6600
3,Paloma,Farias,29/03/1989,Rio de Janeiro,Vestido,2018-02-01,55,55,3025
4,Iago,Bensdorp,11/12/1989,BrasÃ­lia,Vestido,2018-02-01,7,75,525

In [27]:
vendas['Loja'].unique()

array(['Salvador', 'BrasÃ\xadlia', 'SÃ£o Paulo', 'Rio de Janeiro',
       'Porto Alegre', 'Fortaleza', 'Curitiba'], dtype=object)

In [28]:
vendas['Loja']=vendas['Loja'].str.replace('BrasÃ\xadlia','Brasilia')

In [29]:
vendas['Loja']=vendas['Loja'].str.replace('SÃ£o Paulo','Sao Paulo')

In [30]:
vendas['Loja'].unique()

array(['Salvador', 'Brasilia', 'Sao Paulo', 'Rio de Janeiro',
       'Porto Alegre', 'Fortaleza', 'Curitiba'], dtype=object)

In [31]:
vendas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1286 entries, 0 to 1285
Data columns (total 9 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Nome                1286 non-null   object
 1   Sobrenome           1286 non-null   object
 2   Data de Nascimento  1286 non-null   object
 3   Loja                1286 non-null   object
 4   Produto             1286 non-null   object
 5   Data                1286 non-null   datetime64[ns]
 6   Quantidade Vendida  1286 non-null   int32
 7   Preco               1286 non-null   int32
 8   Faturamento         1286 non-null   int32
dtypes: datetime64[ns](1), int32(3), object(5)
memory usage: 75.5+ KB

In [32]:
vendas['Mes_Vendas'] = vendas['Data'].dt.month

In [33]:
vendas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1286 entries, 0 to 1285
Data columns (total 10 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Nome                1286 non-null   object
 1   Sobrenome           1286 non-null   object
 2   Data de Nascimento  1286 non-null   object
 3   Loja                1286 non-null   object
 4   Produto             1286 non-null   object
 5   Data                1286 non-null   datetime64[ns]
 6   Quantidade Vendida  1286 non-null   int32
 7   Preco               1286 non-null   int32
 8   Faturamento         1286 non-null   int32
 9   Mes_Vendas          1286 non-null   int64
dtypes: datetime64[ns](1), int32(3), int64(1), object(5)
memory usage: 85.5+ KB

In [34]:
vendas['Produto']= vendas['Produto'].str.replace('SandÃ¡lia','Sandalia')

In [35]:
vendas['Produto']= vendas['Produto'].str.replace('TÃªnis','Tenis')

In [36]:
vendas['Produto'].unique()

array(['Casaco', 'Camiseta', 'Sapato', 'Vestido', 'Sandalia', 'Saia',
       'Bermuda', 'Pulseira', 'Jaqueta', 'Tenis', 'Short', 'Chinelo'],
      dtype=object)

In [37]:
vendas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1286 entries, 0 to 1285
Data columns (total 10 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Nome                1286 non-null   object
 1   Sobrenome           1286 non-null   object
 2   Data de Nascimento  1286 non-null   object
 3   Loja                1286 non-null   object
 4   Produto             1286 non-null   object
 5   Data                1286 non-null   datetime64[ns]
 6   Quantidade Vendida  1286 non-null   int32
 7   Preco               1286 non-null   int32
 8   Faturamento         1286 non-null   int32
 9   Mes_Vendas          1286 non-null   int64
dtypes: datetime64[ns](1), int32(3), int64(1), object(5)
memory usage: 85.5+ KB

In [38]:
vendas.head()

,Nome,Sobrenome,Data de Nascimento,Loja,Produto,Data,Quantidade Vendida,Preco,Faturamento,Mes_Vendas
0,Elizeu,Barros,16/12/1993,Salvador,Casaco,2018-02-01,105,150,15750,2
1,Andrew,Carvalhal,18/07/1992,Brasilia,Camiseta,2018-02-01,57,250,14250,2
2,Andrew,Carvalhal,12/02/1985,Sao Paulo,Sapato,2018-02-01,44,150,6600,2
3,Paloma,Farias,29/03/1989,Rio de Janeiro,Vestido,2018-02-01,55,55,3025,2
4,Iago,Bensdorp,11/12/1989,Brasilia,Vestido,2018-02-01,7,75,525,2

In [39]:
vendas['Data'] =pd.to_datetime(vendas['Data'])

In [40]:
vendas['Data'] = vendas["Data"].dt.strftime("%d/%m/%Y")

In [41]:
vendas.head()

,Nome,Sobrenome,Data de Nascimento,Loja,Produto,Data,Quantidade Vendida,Preco,Faturamento,Mes_Vendas
0,Elizeu,Barros,16/12/1993,Salvador,Casaco,01/02/2018,105,150,15750,2
1,Andrew,Carvalhal,18/07/1992,Brasilia,Camiseta,01/02/2018,57,250,14250,2
2,Andrew,Carvalhal,12/02/1985,Sao Paulo,Sapato,01/02/2018,44,150,6600,2
3,Paloma,Farias,29/03/1989,Rio de Janeiro,Vestido,01/02/2018,55,55,3025,2
4,Iago,Bensdorp,11/12/1989,Brasilia,Vestido,01/02/2018,7,75,525,2

In [42]:
vendas.sort_values("Data", inplace = True)

In [43]:
vendasg=vendas.groupby(['Data','Loja'])['Faturamento'].agg('sum').reset_index(name='Total')

In [44]:
vendas_date= vendas.groupby('Mes_Vendas')['Faturamento'].sum()

In [45]:
vendas_date

Mes_Vendas
1     1234980
2     1000940
3     1166215
4     1080335
5      548060
6     1135865
7     1040895
8     1357145
9     1083055
10     425395
11    1083830
12    1226335
Name: Faturamento, dtype: int32

In [46]:
vendas['Mes_Vendas'] = vendas['Mes_Vendas'].replace({1:'Janeiro',2:'Fevereiro',3:'Marco',4:'Abril',5:'Maio',6:'Junho',7:'Julho',
                                                    8:'Agosto',9:'Setembro',10:'Outubro',11:'Novembro',12:'Dezembro'})

In [47]:
vendas['Mes_Vendas'].unique()

array(['Fevereiro', 'Marco', 'Abril', 'Maio', 'Junho', 'Julho', 'Agosto',
       'Setembro', 'Outubro', 'Novembro', 'Janeiro', 'Dezembro'],
      dtype=object)

In [48]:
vendas['Data'] = pd.to_datetime(vendas['Data'])

In [49]:
vendas['Mes_Vendas_Num'] = vendas['Data'].dt.month

In [50]:
vendas.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1286 entries, 0 to 1285
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Nome                1286 non-null   object
 1   Sobrenome           1286 non-null   object
 2   Data de Nascimento  1286 non-null   object
 3   Loja                1286 non-null   object
 4   Produto             1286 non-null   object
 5   Data                1286 non-null   datetime64[ns]
 6   Quantidade Vendida  1286 non-null   int32
 7   Preco               1286 non-null   int32
 8   Faturamento         1286 non-null   int32
 9   Mes_Vendas          1286 non-null   object
 10  Mes_Vendas_Num      1286 non-null   int64
dtypes: datetime64[ns](1), int32(3), int64(1), object(6)
memory usage: 105.5+ KB

In [51]:
vendas.head()

,Nome,Sobrenome,Data de Nascimento,Loja,Produto,Data,Quantidade Vendida,Preco,Faturamento,Mes_Vendas,Mes_Vendas_Num
0,Elizeu,Barros,16/12/1993,Salvador,Casaco,2018-01-02,105,150,15750,Fevereiro,1
1,Andrew,Carvalhal,18/07/1992,Brasilia,Camiseta,2018-01-02,57,250,14250,Fevereiro,1
2,Andrew,Carvalhal,12/02/1985,Sao Paulo,Sapato,2018-01-02,44,150,6600,Fevereiro,1
3,Paloma,Farias,29/03/1989,Rio de Janeiro,Vestido,2018-01-02,55,55,3025,Fevereiro,1
4,Iago,Bensdorp,11/12/1989,Brasilia,Vestido,2018-01-02,7,75,525,Fevereiro,1

In [52]:
vendas = vendas.sort_values("Mes_Vendas_Num")

In [53]:
vendas.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1286 entries, 0 to 1285
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Nome                1286 non-null   object
 1   Sobrenome           1286 non-null   object
 2   Data de Nascimento  1286 non-null   object
 3   Loja                1286 non-null   object
 4   Produto             1286 non-null   object
 5   Data                1286 non-null   datetime64[ns]
 6   Quantidade Vendida  1286 non-null   int32
 7   Preco               1286 non-null   int32
 8   Faturamento         1286 non-null   int32
 9   Mes_Vendas          1286 non-null   object
 10  Mes_Vendas_Num      1286 non-null   int64
dtypes: datetime64[ns](1), int32(3), int64(1), object(6)
memory usage: 105.5+ KB

In [54]:
vendas.head()

,Nome,Sobrenome,Data de Nascimento,Loja,Produto,Data,Quantidade Vendida,Preco,Faturamento,Mes_Vendas,Mes_Vendas_Num
0,Elizeu,Barros,16/12/1993,Salvador,Casaco,2018-01-02,105,150,15750,Fevereiro,1
93,Juliane,Felipi,09/04/1992,Salvador,Sapato,2018-01-27,43,75,3225,Janeiro,1
92,Izabel,Milagre,24/07/1988,Rio de Janeiro,Pulseira,2018-01-27,139,25,3475,Janeiro,1
60,Maryanna,Correa,08/10/1989,Curitiba,Casaco,2018-01-17,86,55,4730,Janeiro,1
90,Maryanna,Correa,01/05/1993,Brasilia,Vestido,2018-01-26,7,150,1050,Janeiro,1

In [55]:
faturamento_total = vendas['Faturamento'].sum()

In [56]:
faturamento_total

12383050

In [57]:
Unidades_vendidas = vendas['Quantidade Vendida'].sum()

In [58]:
Unidades_vendidas

92197

In [59]:
Media_Preco = round(vendas['Preco'].mean(),2)

In [60]:
Media_Preco

133.58

In [61]:
vendas['Produto'].value_counts()

Vestido     309
Sapato      213
Casaco      191
Camiseta    125
Saia        100
Sandalia     82
Short        50
Chinelo      47
Bermuda      44
Pulseira     44
Tenis        43
Jaqueta      38
Name: Produto, dtype: int64

In [62]:
Itens_Unicos_a_venda = vendas['Produto'].nunique()

In [63]:
Itens_Unicos_a_venda

12

In [64]:
vendas.head()

,Nome,Sobrenome,Data de Nascimento,Loja,Produto,Data,Quantidade Vendida,Preco,Faturamento,Mes_Vendas,Mes_Vendas_Num
0,Elizeu,Barros,16/12/1993,Salvador,Casaco,2018-01-02,105,150,15750,Fevereiro,1
93,Juliane,Felipi,09/04/1992,Salvador,Sapato,2018-01-27,43,75,3225,Janeiro,1
92,Izabel,Milagre,24/07/1988,Rio de Janeiro,Pulseira,2018-01-27,139,25,3475,Janeiro,1
60,Maryanna,Correa,08/10/1989,Curitiba,Casaco,2018-01-17,86,55,4730,Janeiro,1
90,Maryanna,Correa,01/05/1993,Brasilia,Vestido,2018-01-26,7,150,1050,Janeiro,1

In [65]:
vendas['Data'] = vendas["Data"].dt.strftime("%d/%m/%Y")

In [66]:
vendas['Data'] = pd.to_datetime(vendas['Data'])

In [67]:
vendas.head()

,Nome,Sobrenome,Data de Nascimento,Loja,Produto,Data,Quantidade Vendida,Preco,Faturamento,Mes_Vendas,Mes_Vendas_Num
0,Elizeu,Barros,16/12/1993,Salvador,Casaco,2018-02-01,105,150,15750,Fevereiro,1
93,Juliane,Felipi,09/04/1992,Salvador,Sapato,2018-01-27,43,75,3225,Janeiro,1
92,Izabel,Milagre,24/07/1988,Rio de Janeiro,Pulseira,2018-01-27,139,25,3475,Janeiro,1
60,Maryanna,Correa,08/10/1989,Curitiba,Casaco,2018-01-17,86,55,4730,Janeiro,1
90,Maryanna,Correa,01/05/1993,Brasilia,Vestido,2018-01-26,7,150,1050,Janeiro,1

In [68]:
vendas.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1286 entries, 0 to 1285
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Nome                1286 non-null   object
 1   Sobrenome           1286 non-null   object
 2   Data de Nascimento  1286 non-null   object
 3   Loja                1286 non-null   object
 4   Produto             1286 non-null   object
 5   Data                1286 non-null   datetime64[ns]
 6   Quantidade Vendida  1286 non-null   int32
 7   Preco               1286 non-null   int32
 8   Faturamento         1286 non-null   int32
 9   Mes_Vendas          1286 non-null   object
 10  Mes_Vendas_Num      1286 non-null   int64
dtypes: datetime64[ns](1), int32(3), int64(1), object(6)
memory usage: 105.5+ KB

In [69]:
vendas['Data'] = vendas["Data"].dt.strftime("%d/%m/%Y")

In [70]:
vendas.head()

,Nome,Sobrenome,Data de Nascimento,Loja,Produto,Data,Quantidade Vendida,Preco,Faturamento,Mes_Vendas,Mes_Vendas_Num
0,Elizeu,Barros,16/12/1993,Salvador,Casaco,01/02/2018,105,150,15750,Fevereiro,1
93,Juliane,Felipi,09/04/1992,Salvador,Sapato,27/01/2018,43,75,3225,Janeiro,1
92,Izabel,Milagre,24/07/1988,Rio de Janeiro,Pulseira,27/01/2018,139,25,3475,Janeiro,1
60,Maryanna,Correa,08/10/1989,Curitiba,Casaco,17/01/2018,86,55,4730,Janeiro,1
90,Maryanna,Correa,01/05/1993,Brasilia,Vestido,26/01/2018,7,150,1050,Janeiro,1

In [71]:
max(vendas['Data'])

'31/12/2018'

In [72]:
min(vendas['Data'])

'01/02/2018'

In [73]:
vendas.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1286 entries, 0 to 1285
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Nome                1286 non-null   object
 1   Sobrenome           1286 non-null   object
 2   Data de Nascimento  1286 non-null   object
 3   Loja                1286 non-null   object
 4   Produto             1286 non-null   object
 5   Data                1286 non-null   object
 6   Quantidade Vendida  1286 non-null   int32
 7   Preco               1286 non-null   int32
 8   Faturamento         1286 non-null   int32
 9   Mes_Vendas          1286 non-null   object
 10  Mes_Vendas_Num      1286 non-null   int64
dtypes: int32(3), int64(1), object(7)
memory usage: 105.5+ KB

In [74]:
vendas.head()

,Nome,Sobrenome,Data de Nascimento,Loja,Produto,Data,Quantidade Vendida,Preco,Faturamento,Mes_Vendas,Mes_Vendas_Num
0,Elizeu,Barros,16/12/1993,Salvador,Casaco,01/02/2018,105,150,15750,Fevereiro,1
93,Juliane,Felipi,09/04/1992,Salvador,Sapato,27/01/2018,43,75,3225,Janeiro,1
92,Izabel,Milagre,24/07/1988,Rio de Janeiro,Pulseira,27/01/2018,139,25,3475,Janeiro,1
60,Maryanna,Correa,08/10/1989,Curitiba,Casaco,17/01/2018,86,55,4730,Janeiro,1
90,Maryanna,Correa,01/05/1993,Brasilia,Vestido,26/01/2018,7,150,1050,Janeiro,1

In [75]:
vendas_f = vendas.groupby('Loja')['Faturamento'].agg('sum').reset_index(name='Faturamento total')

In [76]:
vendas_p = vendas.groupby('Produto')['Faturamento'].agg('sum').reset_index(name='Faturamento total')

In [77]:
vendas['Produto'].unique()

array(['Casaco', 'Sapato', 'Pulseira', 'Vestido', 'Short', 'Camiseta',
       'Sandalia', 'Saia', 'Jaqueta', 'Bermuda', 'Tenis', 'Chinelo'],
      dtype=object)

In [78]:
vendas['Produto']= vendas['Produto'].str.replace('SandÃ¡lia','Sandalia')

In [79]:
vendas['Produto']= vendas['Produto'].str.replace('TÃªnis','Tenis')

In [80]:
vendas['Produto'].unique()

array(['Casaco', 'Sapato', 'Pulseira', 'Vestido', 'Short', 'Camiseta',
       'Sandalia', 'Saia', 'Jaqueta', 'Bermuda', 'Tenis', 'Chinelo'],
      dtype=object)

In [81]:
vendas.head()

,Nome,Sobrenome,Data de Nascimento,Loja,Produto,Data,Quantidade Vendida,Preco,Faturamento,Mes_Vendas,Mes_Vendas_Num
0,Elizeu,Barros,16/12/1993,Salvador,Casaco,01/02/2018,105,150,15750,Fevereiro,1
93,Juliane,Felipi,09/04/1992,Salvador,Sapato,27/01/2018,43,75,3225,Janeiro,1
92,Izabel,Milagre,24/07/1988,Rio de Janeiro,Pulseira,27/01/2018,139,25,3475,Janeiro,1
60,Maryanna,Correa,08/10/1989,Curitiba,Casaco,17/01/2018,86,55,4730,Janeiro,1
90,Maryanna,Correa,01/05/1993,Brasilia,Vestido,26/01/2018,7,150,1050,Janeiro,1

In [82]:
vendas.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1286 entries, 0 to 1285
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Nome                1286 non-null   object
 1   Sobrenome           1286 non-null   object
 2   Data de Nascimento  1286 non-null   object
 3   Loja                1286 non-null   object
 4   Produto             1286 non-null   object
 5   Data                1286 non-null   object
 6   Quantidade Vendida  1286 non-null   int32
 7   Preco               1286 non-null   int32
 8   Faturamento         1286 non-null   int32
 9   Mes_Vendas          1286 non-null   object
 10  Mes_Vendas_Num      1286 non-null   int64
dtypes: int32(3), int64(1), object(7)
memory usage: 105.5+ KB

In [83]:
vendas['Data']=pd.to_datetime(vendas['Data'])

In [84]:
vendas.head()

,Nome,Sobrenome,Data de Nascimento,Loja,Produto,Data,Quantidade Vendida,Preco,Faturamento,Mes_Vendas,Mes_Vendas_Num
0,Elizeu,Barros,16/12/1993,Salvador,Casaco,2018-01-02,105,150,15750,Fevereiro,1
93,Juliane,Felipi,09/04/1992,Salvador,Sapato,2018-01-27,43,75,3225,Janeiro,1
92,Izabel,Milagre,24/07/1988,Rio de Janeiro,Pulseira,2018-01-27,139,25,3475,Janeiro,1
60,Maryanna,Correa,08/10/1989,Curitiba,Casaco,2018-01-17,86,55,4730,Janeiro,1
90,Maryanna,Correa,01/05/1993,Brasilia,Vestido,2018-01-26,7,150,1050,Janeiro,1

In [85]:
min(vendas['Data'])

Timestamp('2018-01-02 00:00:00')

In [86]:
max(vendas['Data'])

Timestamp('2018-12-31 00:00:00')

In [87]:
import random

In [88]:
vendas['Devolucoes']=np.random.randint(1, 9, size = 1286)

In [89]:
vendas.head()

,Nome,Sobrenome,Data de Nascimento,Loja,Produto,Data,Quantidade Vendida,Preco,Faturamento,Mes_Vendas,Mes_Vendas_Num,Devolucoes
0,Elizeu,Barros,16/12/1993,Salvador,Casaco,2018-01-02,105,150,15750,Fevereiro,1,1
93,Juliane,Felipi,09/04/1992,Salvador,Sapato,2018-01-27,43,75,3225,Janeiro,1,2
92,Izabel,Milagre,24/07/1988,Rio de Janeiro,Pulseira,2018-01-27,139,25,3475,Janeiro,1,6
60,Maryanna,Correa,08/10/1989,Curitiba,Casaco,2018-01-17,86,55,4730,Janeiro,1,7
90,Maryanna,Correa,01/05/1993,Brasilia,Vestido,2018-01-26,7,150,1050,Janeiro,1,1

In [90]:
Qtd_Devolucoes=vendas['Devolucoes'].sum()

In [91]:
Qtd_Devolucoes

5792

In [92]:
vendas.to_csv('vendas.csv')